---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData
source: html/05db3129-7016-4054-1e93-1c718f1ae3bf.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData

The input data used by external servers for calculation of the pipe fitting and pipe accessory coefficient.

## Syntax (C#)
```csharp
public class PipeFittingAndAccessoryData : IDisposable
```

## Remarks
A FamilyInstance is the input data for the calculation,
 and the result is coefficient for each connector.